app/views/posts/show.html.erb

  <tbody>
    <% policy_scope(@post.comments).each do |comment| %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]