app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("approved", "author", "content", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["approved", "t"], ["author", "fdb"], ["content", "dfgbdd"], ["created_at", "2014-05-21 17:47:10.320666"], ["post_id", 14], ["updated_at", "2014-05-21 17:47:10.320666"]]

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE "comments" SET "approved" = ?, "author" = ?, "updated_at" = ? WHERE "comments"."id" = 2  [["approved", "t"], ["author", ""], ["updated_at", "2014-05-21 19:53:28.242106"]]