app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "published", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "dwcwdc"], ["created_at", "2014-05-21 23:33:08.315369"], ["published", "f"], ["title", "dwc"], ["updated_at", "2014-05-21 23:33:08.315369"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "title" = ?, "updated_at" = ? WHERE "posts"."id" = 822229646  [["body", "\nThis is my first post about how I learn web development"], ["title", "Intro to HTTP"], ["updated_at", "2014-05-08 22:36:39.127908"]]