app/controllers/projects_controller.rb

INSERT INTO "projects" ("created_at", "name", "technologies_used", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-12 21:44:07.448438"], ["name", "My Portfolio"], ["technologies_used", "Ruby, Rails, Zurb"], ["updated_at", "2014-05-12 21:44:07.448438"]]
---
  def create
    @project = Project.new(project_params)
    if @project.save

UPDATE "projects" SET "name" = ?, "technologies_used" = ?, "updated_at" = ? WHERE "projects"."id" = 703402084  [["name", "Kevin's Portfolio"], ["technologies_used", "\nRuby, Rails, Zurb"], ["updated_at", "2014-05-12 23:47:58.239231"]]
---
  def update
    if @project.update_attributes(project_params)